""" შექმენით 5 ცვლადი რომლებშიც შეინახავთ წიგნების თავდაპირველ ფასს, შემდეგ შექმენით ცვლადი რომელშიც შეინახავთ ფასდაკლების ოდენობას, შექმენით ახალი ფასის მქონე წიგნების ცვლადები, რომელთა მნიშვნელობა იქნება ძველ მნიშვნელობას გამოკლებული ახალი, საბოლოოდ კი დაბეჭდეთ ახალი წიგნების ფასები (გამოიყენეთ დღეს ნასწავლი მასალა და საუკეთესო პრაქტიკები: გამოიყენეთ ის რომ ცვლადის მნიშვნელობის მინიჭებისას შეგიძლიათ სხვა ცვლადის გამოყენება, კოდი ახსენით კომენტარების საშვალებით, ცვლადებს დაარქვით აღმწერი სახელები snake_case-ის სტილში"""
#აქ მე ჩამოვწერე სხვადასხვა წიგნები და მათ ფასები 
#ასევე დავწერე ფასდაკლება რამდენია და ახალი წიგნები დავამატე
#ძველი წიგნების ფასებს მივუმატე ახალი წიგნების ფასები და ფასდაკლება გავუკეთე
#გამოვიყენე ქვედატირე და პრინტი რომ გამომესახა ტერმინალში შეკრებული და გამოკლებული წიგნების ღირებულება
#ჩემი აზრით ეს დავალება ძალიან სახალისო იყო და ძალიან მომწონს გოაში სწავლა 
book_harrypotter=200
book_romeoandjuliet=20
book_peterpen=80
ფასდაკლება=100
book_cindarella=30
book_theladyandthetramp=68
print(book_harrypotter+(book_cindarella+book_romeoandjuliet+book_theladyandthetramp+book_peterpen)-ფასდაკლება)
print(book_romeoandjuliet+book_theladyandthetramp)
print(book_romeoandjuliet-ფასდაკლება)