mother = "xatia"
dad = "avto"
aunts = "ina nino"
brothers = "goga and beso"

print(mother + " " + dad + " " + aunts + " " + brothers)

print(5 + 1008)
print(80*90)
print(505//5)
print(797-678)

#პირველრიგში დავწერე ინგლისურად დედა და მივუწერე სახელი როგორც მამას მამიდას და სხვა ოჯახის წევრებს 
#მე ოჯახის წევრებს ერთმანეთი მივუმატე მე გამოვიყენე print და ერთმანეთს მივუმატე ოჯახის წევრები მაგ როგორც მივუმატე mother + xatia
#მათი მიმატებით მათი სახელები დაიწერა ერთად print საშუალებით
#შემდეგ გავაკეთე მათემატიკური მიმატება გამოკლება გამრავლება და გაყოფა 