"""1) გააკეთეთ მაგალითი ყველა გაყოფის ტიპიზე, ახსენით თიოთეული კომენტარებით"""

print(3 // 2) # გაყოფა რომელიც გიბრუნებს მხოლოდ მთელ ნაწილს
print(3 / 2) # ზუსტი გაყოფა სადაც გაქვს წილადი ნაწილიც
print(3 % 2) #ნაშთიანი გაყოფა რომელიც გვიბრუნებს ნაშთს


"""გააკეთეთ 2-2 მაგალითი თთოეულ შედარების ოპერატორზე, გვერდზე კომენტარის საშვალებით მიუთითეთ თუ რომელ boolean მნიშვნელობას გამოიტანას, ასევე კომენტარებით ახსენით თუ რა არის boolean"""

print(5 < 8) # -> true
print(16 < 3) # -> false

print(7 >= 2) # -> true
print(10 >= 20) # -> false

#boolean არის მონაცემთა ტიპი ის იგებს True or False 



"""გააკეთეთ 2-2 მაგალითი ლოგიკურ ოპერატორებზე: and, or, not. კომენტარების საშვლაებით გვერდით მიუწერეთ შედეგი. ახსენით რა არის ლოგიკური ოპერატორი და როგორ მუშაობს ლოგიკური ოპერაცია"""

print(True or False) # True
print(True or True) # False

print(True and False) # False
print(False and False) # False

print(not True) # False
print(not False) # True