"""შექმენით პროგრამა, რომელიც მომხარებელს შემოატანინებს სახელს, შემდეგ კი მიესალმება მისი სახელის დაბეჭდვით"""

name = input('Enter your name: ')



print("Hello, " + name + ". Have great day")



"""გააკეთეთ კონკატინაციისა და შეკრების მაგალითები თითოეულზე 2, კომენტარებით ახსენით რა არის კონკატინაცია და შეკრება"""

# შეკრება როდესაც ინტეჯერები ერთმანეთს ემატება ჯამის დროს ხდება მათემატიკური შეკრება
print(2 + 10)
print(24 + 39)

# სტრინგების დამატება არის კონკატინაცია კონკატინაცია იწვევეს სტრინგების შეერთებას
print("10" + "60")
print("60" + "356")


